Tekla.Structures.Model.LoftedPlate.LoftedPlateFaceTypeEnum
Lofted plate solid creation face types.

Tekla.Structures.Model.LoftedPlate.LoftedPlateFaceTypeEnum.Perpendicular
Faces are perpendicular to the thickness direction.

Tekla.Structures.Model.LoftedPlate.LoftedPlateFaceTypeEnum.BoundedByCurvePlanes
Faces following each curve plane.